
""" This script is for emo_lexicon used for emo_process"""

emoji_dic = {
"anger":            ['U+1F52A', 'U+1F621', 'U+1F92C', 'U+2763',  'U+1F9E0', 'U+1F6AB',],
"anger_emoji":      ['🔪',      '😡',      '🤬',      '❣',       '🧠',      '🚫',],
"anger_score":      [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],

"excitement":       ['U+1F44F', 'U+1F923', 'U+1F929', 'U+1F412', 'U+1F6A8', 'U+1F47D',],
"excitement_emoji": ['🌟',      '🤣',      '🤩',      '🐒',      '🚨',      '👽',],
"excitement_score": [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],

"fear":             ['U+1F47B', 'U+1F631', 'U+1F9DF', 'U+2694',  'U+1F5A4', 'U+1F198',],
"fear_emoji":       ['👻',      '😱',      '🧟',      '⚔',       '🖤',      '🆘',],
"fear_score":       [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],

"pleasant":         ['U+1F308', 'U+1F60E', 'U+1F917', 'U+1F64C', 'U+1F4C8', 'U+1F3A9',],
"pleasant_emoji":   ['🌈',      '😎',      '🤗',      '🙌',      '📈',      '🎩',],
"pleasant_score":   [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],

"happy":            ['U+1F600', 'U+1F603', 'U+1F642', 'U+1F970', 'U+1F618', 'U+2764',],
"happy_emoji":      ['😀',      '😃',      '🙂',      '🥰',      '😘',      '❤',],
"happy_score":      [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],

"surprise":         ['U+1F389', 'U+1F381', 'U+1F64B', 'U+1F3B6', 'U+1F525', 'U+1F4A5',],
"surprise_emoji":   ['🎉',      '🎁',      '🙋',      '🎶',      '🔥',      '💥',],
"surprise_score":   [0.6,       0.5,       0.4,       0.3,       0.2,       0.1,],
}

